app/views/projects/show.html.erb

SELECT COUNT(*) FROM "cables" WHERE "cables"."conduit_id" = ?  [["conduit_id", 1]]
---
          <td><%= conduit.from %></td>
          <td class='cable-count'><%= conduit.cables.count %></td>