app/views/projects/show.html.erb

      <tbody>
        <% @project.conduits.each do |conduit| %>
---
SELECT "conduits".* FROM "conduits" WHERE "conduits"."project_id" = ?  [["project_id", 1]]

            <td><%= conduit.from %></td>
            <td class='cable-count'><%= conduit.cables.count %></td>
---
SELECT "cables".* FROM "cables" WHERE "cables"."conduit_id" = ?  [["conduit_id", 1]]
SELECT COUNT(*) FROM "cables" WHERE "cables"."conduit_id" = ?  [["conduit_id", 1]]