app/controllers/cables_controller.rb

SELECT "cables".* FROM "cables"
---
  def index
    @cables = Cable.all

INSERT INTO "cables" ("tag", "conduit_id", "conductors", "size", "od", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["tag", "P-01"], ["conduit_id", 1], ["conductors", 3], ["size", "1/0"], ["od", 0.5], ["created_at", "2024-08-04 03:20:32.408235"], ["updated_at", "2024-08-04 03:20:32.408235"]]
---
  def create
    @cable = Cable.new(cable_params)

    respond_to do |format|
      if @cable.save

SELECT "cables".* FROM "cables" WHERE "cables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cable
      @cable = Cable.find(params[:id])