app/controllers/conduits_controller.rb

  def index
    @conduits = Conduit.all
---
SELECT "conduits".* FROM "conduits"

  def edit
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @conduit = Conduit.new(conduit_params)
    # @conduit.project_id = @project.id

    respond_to do |format|
      if @conduit.save
---
INSERT INTO "conduits" ("tag", "size", "to", "from", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["tag", "K-02"], ["size", 2.0], ["to", "asd"], ["from", "ghj"], ["project_id", 1], ["created_at", "2024-08-07 04:55:49.571830"], ["updated_at", "2024-08-07 04:55:49.571830"]]

    def set_conduit
      @conduit = Conduit.find(params[:id])
---
SELECT "conduits".* FROM "conduits" WHERE "conduits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_project
      @project = Project.find_by_id(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]