app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" INNER JOIN "user_projects" ON "projects"."id" = "user_projects"."project_id" WHERE "user_projects"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @projects = User.find_by_id(session[:user_id]).projects

INSERT INTO "user_projects" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["project_id", 4], ["created_at", "2024-08-04 02:46:15.699026"], ["updated_at", "2024-08-04 02:46:15.699026"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "projects" INNER JOIN "user_projects" ON "projects"."id" = "user_projects"."project_id" WHERE "user_projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def protect_project_paths
      unless User.find_by_id(session[:user_id]).projects.include? @project