app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "first_name", "last_name", "password_digest", "email", "created_at", "updated_at", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?)